# BalusterPlacement Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPlacement Class
Members See Also
---
A class which contains information regarding baluster and post placement for a given railing type.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class BalusterPlacement : IDisposable
```

Visual Basic
---
```text
Public Class BalusterPlacement _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BalusterPlacement : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Architecture..::..BalusterPlacement
# See Also
BalusterPlacement Members
Autodesk.Revit.DB.Architecture Namespace